Repository: 4d-depot/HDI_LISTBOXES_Demo_V2
Catalog: Resources/*.lproj/ListboxesFR.xlf
Languages: fr

# MenuDemo_4Dpictures
source: Listboxes Demo
fr: Démo Listboxes

# MenusDemo_CloseWindow
source: Close window
fr: Fermer fenêtre

# Page0_ArraysAndReccords
source: Arrays and records
fr: Tableaux et enregistrements

# Page0_Events
source: Events
fr: Événements

# Page0_Footers
source: Headers and Footers
fr: En-têtes et Pieds

# Page0_Function
source: Functionalities
fr: Fonctionnalités

# Page0_Informations
source: Information
fr: Informations

# Page0_LockedCells
source: Locked cells
fr: Cellules verrouillées

# Page0_LockedColumns
source: Locked columns
fr: Colonnes verrouillées

# Page0_SynchronizedOrHierarchical
source: Synchronized or hierarchicals
fr: Synchronisés ou hiérarchiques

# Page0_HeightsAndAlignments
source: Height and alignment
fr: Hauteurs et alignements

# Page0_ChoiceLists
source: Associated lists
fr: Listes associées

# Calc_Average
source: Average
fr: Moyenne

# Calc_Sum
source: Sum
fr: Somme

# ClicColumnsCalculation
source: Click here to change column calculation.
fr: Cliquez ici pour modifier la valeur calculée.

# ClicColumnsChange
source: Click here to change column content.
fr: Cliquez ici pour modifier le contenu de la colonne.

# ClicColumnsSort
source: Click here to sort columns
fr: Cliquez-ici pour trier les colonnes

# TextInfos_4
source: Listboxes contain "headers" and "footers". The headers are mandatory numerical variables used to determine the sort order. The footers can hold any type of variable. The values of these variables can be automatically calculated by 4D (Min, Max, Average, etc.). This can be set up for each footer using the form editor or by programming.
fr: Les listbox contiennent des "en-têtes" et des "pieds". Les entêtes sont des obligatoirement des variables numériques qui définissent l'ordre de tri. Quant aux pieds, ils peuvent contenir des variables de tout types. Les valeurs des pieds peuvent être automatiquement calculées par 4D (Min, Max, Moyenne, etc.). Cela peut être défini pour chaque pied, dans l'éditeur de formulaire ou par programmation.

# Calc_Count
source: Count
fr: Nombre

# TextInfos_6
source: Hierachical listboxes must use arrays as data sources. Nevertheless, these arrays can be filled "on the fly" thanks to the events "on expand" and "on collapse" that are generated in the listbox object. The advantage of this technique is to avoid saturating the memory by filling arrays needlessly.
fr: Les listbox hiérarchiques acceptent uniquement des tableaux comme sources de données. Il est cependant possible de remplir ces tableaux "à la volée" grâce aux événements "sur déployer" et "sur contracter" qui sont générés dans l'objet list box. L'avantage de cette technique est de ne pas risquer de saturer la mémoire en remplissant inutilement les tableaux.

# NumberOfRecordsInTable
source: Number of records in the table:
fr: Nombre d'enregistrements dans la table :

# NumberOfRowsInListbox
source: Number of rows in the listbox:
fr: Nombre de lignes dans la listbox :

# Page2_DisplayRealContentNonHierarchical
source: Display real content (non-hierarchical)
fr: Afficher le contenu réel (non hiérarchique)

# TextInfos_8
source: The first columns of the listboxes can be defined as "locked" which means they cannot be scrolled horizontally and are always visible. They also can be set up as "static" which means they cannot be moved or switched any longer with any other columns. In the example above, the colomns are displayed using red characters and locked columns are displayed on a blue background.
fr: Les premières colonnes des list box peuvent être définies comme "verrouillées" c'est à dire qu'on ne pourra plus les faire défiler horizontalement et qu'elles resteront toujours visibles. Elles peuvent également étre définies comme "statiques", c'est à dire ne pouvant pas être déplacées ou échangées avec d'autres colonnes. Dans l'exemple ci-dessus, les colonnes statiques sont affichées en caractères rouges et les colonnes verrouillées sur fond bleu.

# StaticColumnsColon
source: Static columns:
fr: Colonnes statiques :

# LockedColumnsColon
source: Locked columns:
fr: Colonnes verrouillées :

# StaticInfos0
source: All columns can be moved.
fr: Toutes les colonnes peuvent être déplacées.

# StaticInfos1
source: One column is static and cannot be moved.
fr: Une colonne est statique et ne peut pas être déplacées.

# StaticInfos2
source: <n> columns are static and cannot be moved.
fr: <n> colonnes sont statiques et ne peuvent pas être déplacées.

# LockInfos0
source: All columns can be scrolled.
fr: Toutes les colonnes peuvent être défilées horizontalement.

# LockInfos1
source: One column is locked and cannot be scrolled horizontally.
fr: Une colonne est verrouillée on ne peut plus la faire défiler horizontalement.

# LockInfos2
source: <n> columns are locked and cannot be scrolled hozizontally.
fr: <n> colonnes sont verrouillées on ne peut plus les faire défiler horizontalement.

# AlignmentsColon
source: Alignment:
fr: Alignements :

# AltBackgndColorColon
source: Alt. background color:
fr: Coul. arrière-plan alt. :

source: Apply
fr: Appliquer

# ApplyToColon
source: Apply to:
fr: Appliquer à :

source: Arrays
fr: Tableaux

source: Artists
fr: Artistes

source: Artists/Albums/Tracks
fr: Artistes/Albums/Pistes

# BackgroundColorColon
source: Background color:
fr: Couleur d'arrière-plan :

source: Durations
fr: Durées

source: Footers
fr: Pieds

# GridAndScrollbars
source: Grid & Scrollbars
fr: Grilles et Ascenseurs

# GridColorColon
source: Grid color:
fr: Couleur de grille :

source: Header 1
fr: En-tête 1

source: Header 2
fr: En-tête 2

source: Header 3
fr: En-tête 3

source: Headers
fr: En-têtes

# HeightsColon
source: Height:
fr: Hauteurs :

source: Hide footers
fr: Masquer les pieds

source: Hide headers
fr: Masquer les en-têtes

source: Hide hor. grid
fr: Masquer grille hor.

# HideHorScroll
source: Hide hor. scrollbar
fr: Masquer ascenseur hor.

source: Hide vert. grid.
fr: Masquer grille vert.

# HideVertScroll
source: Hide vert. scrollbar
fr: Masquer ascenseur hor.

# Hierarchical
source: Hierarchical view
fr: Vue hiérarchique

# Pathes
source: Files pathes
fr: Chemins d'accès

source: Records
fr: Enregistrements

source: Rows
fr: Lignes

# Synchronized
source: Synchronized view
fr: Vue synchronisée

# TextColorColon
source: Text color:
fr: Couleur du texte :

source: Tracks
fr: Pistes

# ListboxArrays
source: List box based on arrays
fr: List box de type tableaux

# ListboxSelection
source: List box based on records selection
fr: List box de type sélection

# ListboxCollection
source: List box based on collection
fr: List box de type collection

# ListboxEntitySelection
source: List box based on entity selection
fr: List box de type entity selection

# TextInfos_2
source: Listboxes can contain either arrays (texts, numbers, dates, pictures, etc.) or fields from the tables of the database. In both cases, the values can be enterable or not, depending on the developer's choice. The number of arrays as well as their sizes are limited by the available memory, so, when working with a large amount of data, you should consider using records rather than arrays.
fr: Les listbox peuvent contenir soit des tableaux (textes, numériques, dates, images, etc.), soit des champs provenant des tables de la base de données. Dans un cas comme dans l'autre, les valeurs peuvent être saisissables ou non, au choix du développeur. Le nombre et la taille des tableaux sont limités par la mémoire vive disponible, aussi, lors de la manipulation d'un grand nombre de données, il est préférable d'afficher directement les enregistrements plutôt que des tableaux.

# TextInfos_2a
source: When using arrays, they will always be synchronised during sort operations and must contain the same number of rows. If they don't, some of them (the last ones) will not be displayed.
fr: Lors de l'utilisation de tableaux, ces derniers seront toujours synchronisés lors des tris et doivent comporter le même nombre de lignes. Dans le cas contraire, certaines d'entre elles (les dernières) ne seront pas représentées.

# TextInfos_2b
source: When displaying directly a selection of records, the columns may contain formulas: in this example, the 1st column contains the concatenation of three fields belonging to three distinct tables linked together by an automatic relation.
fr: Lors de la représentation directe d'une sélection enregistrements, les colonnes peuvent contenir des formules : ici, la 1ère colonne contient la concaténation de trois champs appartenant à trois tables distinctes reliées par un lien automatique.

# TextInfos_1
source: The list boxes are objects used to display or modify arrays or records. The graphical appearence of listboxes is highly customizable. Colors, sizes, styles as well as visibility of the objects that belong to it (columns, headers, footers, scrollbars, grid, etc.) can be modified directly in the form editor as well as using programming.
fr: Les list box sont des objets destinés à l'affichage ou à la saisie de tableaux ou d'enregistrements. L'aspect graphique des list box est hautement paramétrable. Les couleurs, tailles, styles ainsi que la visiblité des parties qui la constituent (colonnes, entêtes, pieds, ascenseurs, séparateurs‚…) peuvent être modifiés directement dans l'éditeur de formulaires ainsi que par programmation.

# TextInfos_3
source: The list boxes that contain arrays can have two display modes : synchronized arrays or hierarchical. The hierarchy is based on repetition of values inside the N first arrays. N represents the number of hierachical levels that can be defined in the form editor or by programming.
fr: Les list box qui affichent des tableaux peuvent avoir deux mode de représentation : tableaux synchronisés ou hiérarchiques. La hiérarchie est basée sur la répétition de valeurs dans les N premiers tableaux. N représente le nombre de niveaux de hiérarchie qui peut être défini dans l'éditeur de formulaire ou, a posteriori, par programmation.

# MandatoryForHierachical
source: (Mandatory for hierachical mode)
fr: (Obligatoire pour le mode hiérarchique)

source: Lines
fr: Lignes

source: All
fr: Tout

source: Left
fr: Gauche

source: Right
fr: Droite

source: Center
fr: Centre

source: Top
fr: En haut

source: Bottom
fr: En bas

# TextInfos_7
source: The height of the rows as well as headers and footers can be set up in "lines" or "pixels" units. Using lines, the height is automatically calculated based on the sizes and fonts used in the objects. Switching from one mode to another, 4D calculates as well as possible the new height in lines or in pixels.
fr: Les hauteurs des lignes ainsi que des entêtes et des pieds peuvent être réglées en "lignes" ou en "pixels". Dans le cas des lignes, la hauteur est calculée automatiquement en fonction de la taille des caractères et de la police utilisée. Lors du passage d'un mode à l'autre, 4D calcule au mieux la nouvelle hauteur soit en pixels, soit en lignes.

# TextInfos_9
source: The cells, and by extension the rows, can be set as enterable or not by programming: This is performed during the event "on before data entry" by using the $0 variable. (*) If this variable is set to zero (default value) then the cell is enterable. If it is set to -1, then the cell will not be enterable. (*) This event is generated in the listbox itself as well as in each included and enterable column.
fr: Les cellules, et par extension les lignes, peuvent être rendues saisissables ou non par programmation : Cela se fait lors de l'exécution de l'événement "Sur avant saisie" en utilisant la variable $0. (*) Si $0 prend la valeur zéro (valeur par défaut) alors la cellule est saisissable. Si la valeur est affecté à -1, alors la cellule est non saisissable. (*) Cet événement est généré dans la list box elle-même ainsi que dans chacune de ses colonnes saisissables.

# TextInfos_9a
source: In the example above, the locking of the rows is based on a boolean array which is read during the event "on before data entry". Locking cells is based on the content of the cells themselves: if a cell is not empty, it is not enterable any longer (this example is of course arbitrary!)
fr: Dans cet exemple, le verrouillage des lignes est basé sur un tableau de booléens qui est lu durant l'événement "Sur avant saisie". Le verrouillage des cellules est basé sur le contenu des cellules elles-mêmes : si la cellule n'est pas vide, elle n'est plus saisissable (C'est un exemple totalement arbitraire bien entendu !)

# LockedCell
source: This cell is locked
fr: Cette cellule est verrouillée

# LockedRow
source: This row is locked
fr: Cette ligne est verrouillée

# Color_1
source: Yellow
fr: Jaune

# Color_10
source: Red
fr: Rouge

# Color_2
source: Blue
fr: Bleu

# Color_4
source: Green
fr: Vert

# Color_5
source: Purple
fr: Mauve

# Color_6
source: White
fr: Blanc

# Color_7
source: Black
fr: Noir

# Color_8
source: Grey
fr: Gris

# Shape_1
source: Square
fr: Carré

# Shape_2
source: Circle
fr: Cercle

# Shape_4
source: Pentagon
fr: Pentagone

# Shape_5
source: Hexagon
fr: Hexagone

# Shape_6
source: Line
fr: Ligne

# Shape_7
source: Spot
fr: Point

# Shape_8
source: Octogon
fr: Octogone

# Shapa_10
source: Polygon
fr: Polygone

# TextInfos_5
source: Choice lists can be associated with columns. These associations can be defined directly in Design mode in the form editor or, afterwards, by programming. This might be very useful according to the different contexts of use of the same listbox. When the listbox contains arrays, a specific command allows you to insert or delete one or more rows at once, which avoids having to do so individually in each displayed array.
fr: Des listes de valeurs peuvent être associées aux colonnes. Ces associations peuvent être définies directement en mode développement dans l'éditeur de formulaire ou bien, a posteriori, par programmation. Cela peut-être très utile selon les différents contextes d'utilisation d'une même listbox. Quand la listbox contient des tableaux, une commande spécifique permet également d'y insérer ou d'y supprimer une ou plusieurs lignes, ce qui évite de le faire individuellement pour chacun des tableaux représentés.

# UseChoiceListColon
source: Associate list:
fr: Associer la liste :

# ToColumnColon
source: With column:
fr: À la colonne :

source: Insert
fr: Insérer

source: Delete
fr: Supprimer

# NumberOfLinesColon
source: Number of rows:
fr: Nombre de lignes :

# AfterRowColon
source: After row:
fr: Après la ligne :

source: Choice lists
fr: Liste de valeurs

# InsertDelete
source: Insertion and deletion
fr: Insertions et suppressions

# Material_1
source: Plastic
fr: Plastique

# Material_2
source: Glass
fr: Verre

# Material_3
source: Wood
fr: Bois

# Material_4
source: Steel
fr: Acier

# Material_5
source: Copper
fr: Cuivre

source: None
fr: Aucune

source: Colors
fr: Couleurs

source: Shapes
fr: Formes

source: Material
fr: Materiau

# TextInfos_10
source: The columns that hold text arrays or text fields can, optionally, be set up as multi-styled. This option allows you to display contents with distinct colors, sizes, and font famillies.
fr: Les colonnes contenant des tableaux ou des champs de type "texte" bénéficient de l'option "multi-styles". Cela permet d'afficher les contenus avec des couleurs, des styles, des tailles et les familles de caractères différents.

# TextInfos_11
source: Collection type list boxes can contain scalar elements (text, numeric, etc.) or objects.
fr: Les list box de type collection peuvent contenir des éléments de type scalaire (textes, numérique, etc.) ou bien des objets.

# TextInfos_12
source: The entity selection list boxes display the attributes of each entity. The content of the columns can also be the result of an expression.
fr: Les list box de type entity selection affichent les attributs de chaque entité. Le contenu des colonnes peut également être le résultat d'une expression.
